<template>
  <div class="notice">
    <div class="demo-collapse">
      <el-collapse v-model="activeName" accordion>
        <el-collapse-item title="软件杂志简介" name="1">
          <div>《软件》（月刊）创刊于1979年，由中国科协主管，中国电子学会、天津电子学会主办，天津电子仪表信息所与中科鼎盛科技发展（北京）中心协办的首届中文核心国际发行期刊，是首批中文核心期刊，被《中国学术期刊综合评价数据库来源期刊》、《中国核心期刊（遴选）数据库收录期刊》、《万方数据—数字化期刊群全文收录期刊》、《中文科技期刊数据库（全文版）收录期刊》、美国《剑桥科学文摘》、波兰《哥白尼索引》收录期刊、美国《乌利希国际期刊指南》等国内外数据库收录。 《软件》获中文核心期刊1994-2004；中科双效期刊；Caj-cd规范获奖期刊；第二届全国优秀科技期刊。</div>
        </el-collapse-item>
        <el-collapse-item title="软件杂志栏目设置" name="2">
          <div>专家论坛 基金项目论文 软件工程 设计研究与应用 计算机应用 计算机教育 软件工程与技术 网络与信息安全 通信技术 数据库技术</div>
        </el-collapse-item>
        <el-collapse-item title="软件杂志必读信息" name="3">
          <div>软件杂志社论文审稿周期：1-3个月的时间</div>
          <div>投稿提示：</div>
          <div>杂志社审稿周期1-3个月，不代表你现在投稿，审稿周期一到就能发表，仅仅是在这个时间内审核你的文章，审稿人每天会收到很多稿件，即使你的文章优秀，被审完后无任何问题，也需要排期发表，因为在你之前已经有很多稿件了，每一期杂志就那么点版面，投稿量远大于现有版面量，今年投稿的论文，正常是需要等到明年（甚至是下半年、后年）见刊，自行投稿会更慢，这是目前行业现状。</div>
        </el-collapse-item>
        <el-collapse-item title="软件杂志投稿要求" name="4">
          <div>1. 《软件》来稿必须是原创性论文,并且未在任何正式出版物上发表过。文字要简练，每篇稿件在 10000 字以内。文章题目在20个字以内。摘要不超过300字，摘要的内容应包含与论文同等量的主要信息，说明研究工作目的、实验方法、结果和最终结论等，而重点是结果和结论。关键词3～8个。文章名、姓名、单位、摘要、关键词内容需全部译成标准英文语言。</div>
          <div>2.《软件》文中插图表精绘,大小一般在200k以上，图形最好用 WORD来画，图中文字清楚, 图、表要求有图号、图名、表号、表名和文中引用。纵横坐标参数以及说明文字用中英文同时译出，参数采用国际规定符号；彩版需要额外支付制作彩版印刷费（如需要请说明）。表格均用三线表，易引起含混时，可加辅线。</div>
          <div>3.《软件》 稿件请用Word编辑排版,按照“<a href="http://compusimu.gnway.cc/2008contribute.doc" style="text-decoration: none;">《软件》杂志文章模板</a>” 写作,作者可参考进行撰写。</div>
          <div>4．获国家自然科学基金或其它省、部级重点基金资助以及重大获奖项目的文稿请注明：资助基金名称、项目编号、项目名称以及获奖类别，本刊特别欢迎基金项目文章。</div>
          <div>5．每篇稿件必须提供第一作者简介，内容为：姓名、职称 / 学位、主研领域。并提供第一作者的身份证号，同时注明作者或联系人的姓名、手机号或电话、单位、通信地址、邮政编码、E-mail 地址。审稿期间联系方式如有变化,请及时进入本网站中修改。</div>
          <div>6．若第一作者为“中国计算机学会或中国电子学会”会员，请在投稿时注明会员姓名、会员证号码，优先发表。</div>
          <div>7．文责自负。投稿应具有合法性,包括不存在抄袭、剽窃、侵权、数据不实、一稿多投等不良行为，如发现上述不良行为，作者将承担法律责任。如有泄密，本刊不承担连带责任，文章刊发后版权归《软件》杂志。</div>
          <div>8．本刊现入编多种网络数据库，凡有不同意收录并发布者，投稿时敬请说明或另投它刊。</div>
          <div>9．参考文献 各条参考文献应按其在正文中出现的先后顺序用阿拉伯数字连续用上标排序。</div>
          <div>格式：（详细请参阅《文后参考文献著录规则（GB/T 7714 - 2005）》）</div>
          <div>期刊：[序号] 作者名(外国人姓在前，名在后可缩写，下同)．题目(英文题目第一字母大写，其它均小写).刊名（全称）[J]，年，卷（期）：页码范围． 文集: [序号] 作者．文章题目(英文题目第一字母大写，其它均小写)[C]：//编者．文集标题. 出版地：出版社，出版年：页码范围。</div>
          <div>书籍：[序号] 作者．书名[M]：副标题（如果有）．版次(初版不写 )． 出版社地点：出版社，出版年：页码范围． 学位论文：[序号] 作者．文章题目[D]．单位地点：单位名称，年：页码范围。</div>
          <div>专利文献：[序号]专利申请者。专利题名：专利国别, 专利号[P]。公告日期或公开日期[引用日期]技术标准 ：[序号]起草责任者。 标准代号 标准顺序号—发布年 标准名称[S]。出版地：出版者，出版年（也可略去起草责任者、出版地、出版者和出版年）电子文档：[序号]作者。题名[EB/OL]。（更新或修改日期）[引用日期(用投稿日期代替即可）]。获取和访问途径[1] 箫珏。出版业信息化迈入快车道[OL]。</div>
          <div>10.常见问题请参考文档“<a href="http://compusimu.gnway.cc/cjwt.doc" style="text-decoration: none;">常见问题</a>”。</div>
        </el-collapse-item>
      </el-collapse>
    </div>
  </div>
</template>

<script lang="ts" setup>
import { ref } from 'vue'
const activeName = ref('1')
</script>


<style lang="less">
.notice{
  .el-collapse-item__content {
    font-size: 16px;
    font-family:华文中宋;
  }
  .el-collapse-item__header {
    font-size: 20px;
    font-family:华文中宋;
    color: cadetblue;
  }
}
</style>